## Ufuncs : 索引的保存
Pandas 是設計給 Numpy一起用的，任何 NumPy的 ufunc 都可以在 Pandas 的 Series 和 DataFrame 物件上運作

In [1]:
import pandas as pd
import numpy as np

rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [8]:
df = pd.DataFrame(rng.randint(0,10,(3,4)),columns=['A','B','C','D'])
df

   A  B  C  D
0  9  4  1  3
1  6  7  2  0
2  3  1  7  3

In [9]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [18]:
np.sin(df * np.pi / 4)

          A             B         C         D
0  0.707107  1.224647e-16  0.707107  0.707107
1 -1.000000 -7.071068e-01  1.000000  0.000000
2  0.707107  7.071068e-01 -0.707107  0.707107

## Ufuncs : 索引對齊
### 在Series中對齊索引

In [10]:
area = pd.Series({'Alaska':172336,'Texas':695662,'California':423967},name='area')
population = pd.Series({'California':38332521,'Texas':26448193,'New York':19651127},name='population')
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [12]:
# 索引聯集
area.index | population.index

C:\Users\USER\AppData\Roaming\Python\Python37\site-packages\ipykernel_launcher.py:2: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [13]:
A = pd.Series([2,4,6],index=[0,1,2])
B = pd.Series([1,3,5],index=[1,2,3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [19]:
# 不要有NaN，記得+ fill_value=0，https://zhuanlan.zhihu.com/p/165230863
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

### DataFrame 中的索引對齊

In [20]:
A = pd.DataFrame(rng.randint(0,20,(2,2)), columns=list('AB'))
A

   A  B
0  1  5
1  9  3

In [24]:
B = pd.DataFrame(rng.randint(0,10,(3,3)), columns=list('BAC'))
B

   B  A  C
0  7  2  2
1  0  4  9
2  6  9  8

In [25]:
A+B

      A     B   C
0   3.0  12.0 NaN
1  13.0   3.0 NaN
2   NaN   NaN NaN

In [26]:
fill = A.stack().mean()
A.add(B,fill_value=fill)

      A     B     C
0   3.0  12.0   6.5
1  13.0   3.0  13.5
2  13.5  10.5  12.5

| 運算子 | Pandas方法 | 
| -------- | -------- | 
| +     | add()     | 
| -    | sub(),subtract()     | 
| *     | mul(),mulTiply()     | 
| /     | truediv(),div(),divide()     | 
| //     | floordiv()     | 
| %     | mod()     | 
| **     | pow()     |

### Ufuncs : 在 DataFrame 和 Series 之間的操作

In [37]:
# broadcasting 規則 
A = rng.randint(10,size=(3,4))
A - A[0]

array([[ 0,  0,  0,  0],
       [-6, -2, -1,  6],
       [-2, -6,  0,  4]])

In [40]:
df = pd.DataFrame(A,columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -6 -2 -1  6
2 -2 -6  0  4

In [45]:
df

   Q  R  S  T
0  6  8  7  1
1  0  6  6  7
2  4  2  7  5

In [53]:
df.subtract(df['R'],axis=0) # df['R']變直的

   Q  R  S  T
0 -2  0 -1 -7
1 -6  0  0  1
2  2  0  5  3

In [54]:
halfrow = df.iloc[0,::2] # 第一行，取完隔一個再取
halfrow

Q    6
S    7
Name: 0, dtype: int32

In [55]:
df - halfrow # df.subtract(halfrow)

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -6.0 NaN -1.0 NaN
2 -2.0 NaN  0.0 NaN